{
    "files": [
        {
            ".tag": "file",
            "name": "1608479567887.pdf",
            "path_lower": "/resumes/1608479567887.pdf",
            "path_display": "/Resumes/1608479567887.pdf",
            "id": "id:5C3OJ7DmvMAAAAAAAAAAGw",
            "client_modified": "2022-03-13T13:11:27Z",
            "server_modified": "2022-03-13T13:11:27Z",
            "rev": "015da194d33d8e000000002623d3a50",
            "size": 105385,
            "is_downloadable": true,
            "content_hash": "7e8e08fbc4f60326c6553bad953360fa5e11c513e8cbcd7d6b04def533bcc0b6",
            "desc": "Kishore S +91 8618112194 \" kishoreas7298@gmail.com \" linkedin.com/in/kishore-as/ \" github.com/Kishore7298 Experience Full Stack Developer June 2019 – August 2020 SwitchOn Bengaluru Refactored the Front end application from class based to Hooks and typescript based and the back-end from JavaScript to TypeScript Implemented Equipment page V1 which shows Equipment level industry insights Implemented Issues V2 - To track any issues in the shop-floor Interviewed Candidates for Full stack role Implemented report generation feature, which interacts with python service to generate report Setup CI/CD pipeline for MERN application Wrote unit and integration test cases, used Jest and Enzyme Full Stack Developer intern February. 2019 – May 2019 SwitchOn Bengaluru Worked on the real-time dashboard. Used Socket.io for real time interactions Worked on 'Issues V1' feature Education NMAM Institute of Technology Ududpi, Karnataka Bachelor of Engineering, Major in IT Jun. 2015 – Jun 2019 Kalpataru Pre-university College Tumkur, Karnataka Pre-university, PCMB Jul. 2013 – Jul 2015 Projects Conference App \" JavaScript, Node.js, RabbitMQ, Express.js This app is created with Microservice in mind. It has pages that show all speakers, it has individual pages for a given speaker. It also shows artwork of the speaker and a feedback page which simply lists the feedback Implemented Service registry, which registers the service, deletes the service, expires the service on timeout(listens to the heartbeat) and also does the load balancing by choosing the random instance Implemented three services, Speakers service, Feedback service and Conference app(main app) Implemented Circuit breaker pattern for responsiveness and tolerance, Caching and Queue(RabbitMQ for feedback service) for async communication and fault tolerance Comment system \" React, Node.js, Docker, Kubernetes This is a experimental project on Microservices. This application has support for creating posts, to comment on them and also moderation support Created Different services for Post creation, Comment creation, moderation and event bus for async Communication Used Kubernetes for service communication and orchestration Technical Skills Languages: JavaScript, C/C++, TypeScript, HTML/CSS Frameworks: React, Redux, Node.js, Express.js, Vue.js Databases: MongoDb, SQL Developer Tools: Git, Docker, Kubernetes, Jenkins, AWS, VS Code Libraries: D3.js, Material-UI, Bootstrap Profile Links Geeks for Geeks: auth.geeksforgeeks.org/user/ kishore s /profile Leetcode: leetcode.com/Kishore S/ HackerEarth: hackerearth.com/@kishoreas7298 HackerRank: hackerrank.com/Kishore S CodeChef: codechef.com/users/kishore 7298"
        },
        {
            ".tag": "file",
            "name": "2018_pgee_CSE_Section1_Section2_Sample_Questions.pdf",
            "path_lower": "/resumes/2018_pgee_cse_section1_section2_sample_questions.pdf",
            "path_display": "/Resumes/2018_pgee_CSE_Section1_Section2_Sample_Questions.pdf",
            "id": "id:5C3OJ7DmvMAAAAAAAAAAGQ",
            "client_modified": "2022-03-13T13:11:26Z",
            "server_modified": "2022-03-13T13:11:26Z",
            "rev": "015da194d1f54ad00000002623d3a50",
            "size": 78747,
            "is_downloadable": true,
            "content_hash": "eaccfb39c5235c9d0223983c68047ed9ba8af806c07c8c6767546221acd2b3b9",
            "desc": "General Instructions (1) The motive for enabling this mock SAMPLE test is to familiarize the candidates with the Computer Based Test (CBT) environment of the PGEE 2018, conducted by IIIT Hyderabad. (2) The types of questions and marking scheme is only illustrative and is in no way indicative or representation of the type of questions and marking scheme of the PGEE question paper. (3) The examination is spread over two sections, Section 1 (General Aptitude Questions) and Section 2 (Computer Sceince and Engineering Questions). You cannot review your answers to Section 1 once you start answering Section 2. Section 1 (General Aptitude) Instructions (1) No candidate will be allowed to leave the hall till the end of the examination. (2) Pens, Pencils, Notes, books, log tables, Calculators, any programmable devices, communication devices, any other electronic devices are strictly prohibited in the examination center. (3) Rough sheets and pens will be provided in the examination center. A virtual on- screen calculator is avialable for use. (4) It is a computer based entrance test with multiple choice type questions. (5) No clarification will be provided during the examination. (6) Some questions may have more than one answer correct. Points will be given only when ALL the correct answers are marked and NONE of the incorrect are marked. (1) Three cards are chosen at random from a pack of 52 cards. In how many ways this can be done if all the three cards are of different types? (A) 4 × 133 (B) 13 × 12 × 11 (C) 53 C13 (D) (3 × 13) / (12 × 11) (2) A certain stock of food items is sufficient for 40 men for 12 days. Assuming the eating capacity of all the men to be the same. Find how many days the food stock will last if an additional 15 men join the group? (A) 8 8 11 (B) 8.3 (C) 71 2 (D) 101 3 (3) Three wheels making 60, 36 and 24 revolutions in a minute, start at a certain point in their circumference downwards. Find when they will again come together on the same position. (A) in 6 seconds (B) in 5 seconds (C) in 10 seconds (D) Never (4) The difference between compound interest and simple interest on a certain amount of money at 5% per annum for 2 years is Rs. 15. Find the principal sum. (A) Rs. 4500 (B) Rs. 7500 (C) Rs. 5000 (D) Rs. 6000 (5) All shirts are T-shirts with buttons. No yellow T-shirt has buttons. No shirt is yellow. If the first two statements are true, the third statement is (A) True (B) False (C) Uncertain (6) The hotel is two blocks east of the drugstore. The market is one block west of the hotel. The drugstore is west of the market. If the first two statements are true, the third statement is (A) True (B) False (C) Uncertain (7) In comparison to the standard typewriter keyboard, the ABC keyboard, which places the most-used keys nearest the typist's strongest fingers, allows faster typing and results in less fatigue. Therefore, replacement of standard keyboards with the ABC keyboard will result in an immediate reduction of typing costs. Which of the following, if true, would most weaken the conclusion drawn above? (A) People who use both standard and ABC keyboards report greater difficulty in the transition from the ABC keyboard to the standard keyboard than in the tran- sition from the standard keyboard to the ABC keyboard. (B) ABC keyboards are no more expensive to manufacture than the standard key- boards and require less frequent repair than the standard keyboards. (C) Novice typists can learn to use the ABC keyboard in about the same amount of time that it takes them to learn to use the standard keyboard. (D) The number of businesses and government agencies that use ABC keyboards is increasing each year. (E) The more training and experience an employee has had with the standard key- board, the more costly it is to train that employee to use the ABC keyboard. (8) In Asia, where palm trees are non-native, their flowers have traditionally been polli- nated by hand, which has kept palm fruit productivity unnaturally low. When wee- vils known to be efficient pollinators of palm flowers were introduced into Asia in 1980, palm fruit productivity increased-by up to 50 percent in some areas-but then decreased sharply in 1984. Which of the following statements, if true, would best explain the 1984 decrease in productivity? (A) Rapid increases in productivity tend to deplete trees of nutrients needed for the development of the fruit-producing female flowers. (B) Prices for palm fruit fell between 1980 and 1984 following the rise in produc- tion and a concurrent fall in demand. (C) Imported trees are often more productive than native trees because the imported ones have left behind their pests in their native lands. (D) The weevil population in Asia remained at approximately the same level be- tween 1980 and 1984. (E) Prior to 1984 another species of insect pollinated the Asian palm trees, but not as efficiently the species of weevil that was introduced in 1980. Read the paragraphs below to answer the following two questions. The test that Henrich introduced to the Machiguenga was called the ultimatum game. The rules are simple: in each game there are two players who remain anonymous to each other. The first player is given an amount of money, say $100, and told that he has to offer some of the cash, in an amount of his choosing, to the other subject. The second player can accept or refuse the split. But there's a hitch: players know that if the recipient refuses the offer, both leave empty-handed. North Americans, who are the most common subjects for such experiments, usually offer a 50-50 split when on the giving end. When on the receiving end, they show an eagerness to punish the other player for uneven splits at their own expense. In short, Americans show the tendency to be equitable with strangers and to punish those who are not. Among the Machiguenga, word quickly spread of the young, square-jawed visitor from America giving away money. The stakes Henrich used in the game with the Machiguenga were not insubstantial– roughly equivalent to the few days' wages they sometimes earned from episodic work with logging or oil companies. So Henrich had no problem finding volunteers. What he had great difficulty with, however, was explaining the rules, as the game struck the Machiguenga as deeply odd. When he began to run the game it became immediately clear that Machiguengan behavior was dramatically different from that of the average North American. To begin with, the offers from the first player were much lower. In addition, when on the receiving end of the game, the Machiguenga rarely refused even the lowest possible amount. \"It just seemed ridiculous to the Machiguenga that you would reject an offer of free money,\" says Henrich. \"They just didn't understand why anyone would sacrifice money to punish someone who had the good luck of getting to play the other role in the game.\" (9) From the above passage, what can you conclude about who is Henrich? (A) Henrich is a social scientist studying human psychology. (B) Henrich is a volunteer from North America distributing money. (C) Henrich is movie director who is doing a film on the Machiguenga people. (D) Henrich is a businessman working with oil and logging companies and exploit- ing the Machiguenga people. (E) None of the above. (10) Which of the following best describes the objective of the game that Henrich intro- duced: (A) To see if Americans are more rational than the Machiguenga people. (B) To see if the Machiguenga people are more rational than North Americans. (C) To compare social and economic behaviour between different cultural groups. (D) To verify whether money is a factor in the cohesion of a community. (E) None of the above. Section 2 (Computer Science and Engineering) Instructions (1) No candidate will be allowed to leave the hall till the end of the examination. (2) Pens, Pencils, Notes, books, log tables, Calculators, any programmable devices, communication devices, any other electronic devices are strictly prohibited in the examination center. (3) Rough sheets and pens will be provided in the examination center. A virtual on- screen calculator is avialable for use. (4) It is a computer based entrance test with multiple choice type questions. (5) No clarification will be provided during the examination. (6) Some questions may have more than one answer correct. Points will be given only when ALL the correct answers are marked and NONE of the incorrect are marked. (1) What will the following code fragment output: int P[5] = {3,1,4,2,0}; for (i=0; i < 5; i++) Q[P[i]] = P[i]; for (i=0; i < 5; i++) printf(%d, Q[i]); (A) 31420 (B) 01234 (C) 21403 (D) 43210 (E) 12340 (2) What will the following code fragment output: void fun(int *a, int b) { b++; a[2] = a[1] + 3; } void main() { int A[5] = {0,1,2,3,4}; fun(A, A[2]); printf(%d, A[2]); } (A) 2 (B) 3 (C) 4 (D) 5 (E) 6 (3) Consider the statement, \"If n is divisible by 30 then n is divisible by 2 and by 3 and by 5.\" Which of the following statements is equivalent to this statement? (A) If n is not divisible by 30 then n is divisible by 2 or divisible by 3 or divisible by 5. (B) If n is not divisible by 30 then n is not divisible by 2 or not divisible by 3 or not divisible by 5. (C) If n is divisible by 2 and divisible by 3 and divisible by 5 then n is divisible by 30. (D) If n is not divisible by 2 or not divisible by 3 or not divisible by 5 then n is not divisible by 30. (E) If n is divisible by 2 or divisible by 3 or divisible by 5 then n is divisible by 30. (4) Which of the following statements is the contrapositive of the statement, \"You win the game if you know the rules but are not overconfident.\" (A) If you lose the game then you don't know the rules or you are overconfident. (B) A sufficient condition that you win the game is that you know the rules or you are not overconfident. (C) If you don't know the rules or are overconfident you lose the game. (D) If you know the rules and are overconfident then you win the game. (E) A necessary condition that you know the rules or you are not overconfident is that you win the game. (5) Consider the following four data structures: array, binary search tree, hash table, and a linked list. Which of the following options arranges them in non-decreasing order of worst case runtime for searching? (A) Array, Binary Search Tree, Linked List, Hash Table (B) Hash Table, Binary Search Tree, Linked List, Array (C) Binary Search Tree, Hash Table, Array, Linked List (D) Hash Table, Linked List, Binary Search Tree, Array (6) Call a sorting algorithm \"oblivious\" if it has the same best case and worst case run- time. Of the following standard sorting algorithms, which are oblivious. (i) Merge sort, (ii) Bubble sort, (iii) Quick sort, and (iv) Heap sort (A) All the above (B) (i), (ii), and (iii) (C) Only (ii) (D) (i) and (iv) (7) What is the 2's complement representation of the integer -1 using 16 and 8 bits re- spectively? (A) 0xFF, 0xF (B) 0xFFFF, 0xFF (C) 0xFF00, 0xF0 (D) 0xF000, 0xF0 (E) 0x1000, 0xF0 (8) Choose the digital building blocks from the following list using which we can realize any boolean function. (A) 2-to-1 Multiplexer (B) 4-to-1 Multiplexer (C) 8-to-1 Multiplexer (D) 16-to-1 Multiplexer (E) None of the above (9) Consider the following statements which may or may not be true. (i) A bit in a control register is used to differentiate between kernel and user mode. (ii) A program translates to kernel mode when it executes a bad instruction. (iii) Modification to page tables is possible in user mode. (iv) User can execute arbitrary code in kernel mode. (v) Segmentation fault is a result of executing bad instructions in user mode. Using these statements, identify the observations that are true. (A) Statement (i) is used to protect programs from each other (B) Statement (ii) is false (C) Statement (iii) is essential for processes to execute (D) Statement (iv) is required for object-oriented programs (E) Statement (v) is true (10) Consider the following statements which may or may not be true. (i) A thread shares its registers and stack with other threads of the process. (ii) It is not possible to context-switch between two threads of the same process. (iii) A thread does not have a unique page table but shares it with other threads. (iv) A thread has its own program counter different from other threads of the process. (v) The PCB and TCB of a single-threaded process are identical. Using these statements, identify the observations that are true. (A) Statement (i) is true (B) Statement (ii) is false (C) Statement (iii) is true (D) Statement (iv) is false (E) Statement (v) is false (11) Applying the dynamic programming approach, what is the minimum cost of a matrix- chain product whose sequence of dimensions is hp0, p1, p2, p3, p4i = h25, 75, 20, 95, 110i, when you use the dynamic programming approach? (A) 2500 (B) 12050 (C) 45075 (D) 301500 (E) 6725 (12) Consider the flow network with vertices A, B, C, D, E, F, G and their edges shown in Figure 1. Each edge given in the network has a capacity. For example, the edge (A, B) has capacity 5 (shown near A) and the edge (B, A) has capacity 0 (shown near B). The maximum-flow in the graph from source A to sink G using the Ford- Fulkerson method is Figure 1: Example of a flow network (A) 35 (B) 14 (C) 55 (D) 49 (E) 20"
        },
        {
            ".tag": "file",
            "name": "1608479567887.pdf",
            "path_lower": "/resumes/1608479567887.pdf",
            "path_display": "/Resumes/1608479567887.pdf",
            "id": "id:5C3OJ7DmvMAAAAAAAAAAGw",
            "client_modified": "2022-03-13T13:11:27Z",
            "server_modified": "2022-03-13T13:11:27Z",
            "rev": "015da194d33d8e000000002623d3a50",
            "size": 105385,
            "is_downloadable": true,
            "content_hash": "7e8e08fbc4f60326c6553bad953360fa5e11c513e8cbcd7d6b04def533bcc0b6",
            "desc": "Kishore S +91 8618112194 \" kishoreas7298@gmail.com \" linkedin.com/in/kishore-as/ \" github.com/Kishore7298 Experience Full Stack Developer June 2019 – August 2020 SwitchOn Bengaluru Refactored the Front end application from class based to Hooks and typescript based and the back-end from JavaScript to TypeScript Implemented Equipment page V1 which shows Equipment level industry insights Implemented Issues V2 - To track any issues in the shop-floor Interviewed Candidates for Full stack role Implemented report generation feature, which interacts with python service to generate report Setup CI/CD pipeline for MERN application Wrote unit and integration test cases, used Jest and Enzyme Full Stack Developer intern February. 2019 – May 2019 SwitchOn Bengaluru Worked on the real-time dashboard. Used Socket.io for real time interactions Worked on 'Issues V1' feature Education NMAM Institute of Technology Ududpi, Karnataka Bachelor of Engineering, Major in IT Jun. 2015 – Jun 2019 Kalpataru Pre-university College Tumkur, Karnataka Pre-university, PCMB Jul. 2013 – Jul 2015 Projects Conference App \" JavaScript, Node.js, RabbitMQ, Express.js This app is created with Microservice in mind. It has pages that show all speakers, it has individual pages for a given speaker. It also shows artwork of the speaker and a feedback page which simply lists the feedback Implemented Service registry, which registers the service, deletes the service, expires the service on timeout(listens to the heartbeat) and also does the load balancing by choosing the random instance Implemented three services, Speakers service, Feedback service and Conference app(main app) Implemented Circuit breaker pattern for responsiveness and tolerance, Caching and Queue(RabbitMQ for feedback service) for async communication and fault tolerance Comment system \" React, Node.js, Docker, Kubernetes This is a experimental project on Microservices. This application has support for creating posts, to comment on them and also moderation support Created Different services for Post creation, Comment creation, moderation and event bus for async Communication Used Kubernetes for service communication and orchestration Technical Skills Languages: JavaScript, C/C++, TypeScript, HTML/CSS Frameworks: React, Redux, Node.js, Express.js, Vue.js Databases: MongoDb, SQL Developer Tools: Git, Docker, Kubernetes, Jenkins, AWS, VS Code Libraries: D3.js, Material-UI, Bootstrap Profile Links Geeks for Geeks: auth.geeksforgeeks.org/user/ kishore s /profile Leetcode: leetcode.com/Kishore S/ HackerEarth: hackerearth.com/@kishoreas7298 HackerRank: hackerrank.com/Kishore S CodeChef: codechef.com/users/kishore 7298"
        }
    ]
}
